## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,246 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = -1
+      + id                              = (known after apply)
+      + internet_ingestion_enabled      = true
+      + internet_query_enabled          = true
+      + local_authentication_disabled   = false
+      + location                        = "canadacentral"
+      + name                            = "app-test-law"
+      + primary_shared_key              = (sensitive value)
+      + resource_group_name             = "app-test-resource-group"
+      + retention_in_days               = (known after apply)
+      + secondary_shared_key            = (sensitive value)
+      + sku                             = "PerGB2018"
+      + tags                            = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-test"
+        }
+      + workspace_id                    = (known after apply)
+    }
+
+  # module.network_security_group.azurerm_monitor_diagnostic_setting.nsg_diagnostic[0] will be created
+  + resource "azurerm_monitor_diagnostic_setting" "nsg_diagnostic" {
+      + id                             = (known after apply)
+      + log_analytics_destination_type = "AzureDiagnostics"
+      + log_analytics_workspace_id     = (known after apply)
+      + name                           = "nsg-diagnostic-log-app-test-cace"
+      + target_resource_id             = (known after apply)
+
+      + enabled_log {
+          + category       = "NetworkSecurityGroupEvent"
+            # (1 unchanged attribute hidden)
+        }
+      + enabled_log {
+          + category       = "NetworkSecurityGroupRuleCounter"
+            # (1 unchanged attribute hidden)
+        }
+
+      + enabled_metric (known after apply)
+
+      + metric (known after apply)
+    }
+
+  # module.network_security_group.azurerm_network_security_group.nsg[0] will be created
+  + resource "azurerm_network_security_group" "nsg" {
+      + id                  = (known after apply)
+      + location            = "canadacentral"
+      + name                = "nsg-app-test-cace"
+      + resource_group_name = "app-test-resource-group"
+      + security_rule       = (known after apply)
+      + tags                = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app-test-cace"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-nsg"
+        }
+
+      + timeouts {
+          + create = "30m"
+          + delete = "30m"
+          + read   = "5m"
+          + update = "30m"
+        }
+    }
+
+  # module.network_security_group.azurerm_network_security_rule.inbound["https"] will be created
+  + resource "azurerm_network_security_rule" "inbound" {
+      + access                      = "Allow"
+      + description                 = "ssh allowed port"
+      + destination_address_prefix  = "VirtualNetwork"
+      + destination_port_ranges     = [
+          + "22",
+        ]
+      + direction                   = "Inbound"
+      + id                          = (known after apply)
+      + name                        = "https"
+      + network_security_group_name = "nsg-app-test-cace"
+      + priority                    = 102
+      + protocol                    = "*"
+      + resource_group_name         = "app-test-resource-group"
+      + source_address_prefix       = "0.0.0.0/0"
+      + source_port_ranges          = [
+          + "443",
+          + "80",
+        ]
+
+      + timeouts {
+          + create = "30m"
+          + delete = "30m"
+          + read   = "5m"
+          + update = "30m"
+        }
+    }
+
+  # module.network_security_group.azurerm_network_security_rule.inbound["ssh"] will be created
+  + resource "azurerm_network_security_rule" "inbound" {
+      + access                      = "Allow"
+      + description                 = "ssh allowed port"
+      + destination_address_prefix  = "VirtualNetwork"
+      + destination_port_ranges     = [
+          + "22",
+        ]
+      + direction                   = "Inbound"
+      + id                          = (known after apply)
+      + name                        = "ssh"
+      + network_security_group_name = "nsg-app-test-cace"
+      + priority                    = 101
+      + protocol                    = "Tcp"
+      + resource_group_name         = "app-test-resource-group"
+      + source_address_prefix       = "VirtualNetwork"
+      + source_port_range           = "*"
+
+      + timeouts {
+          + create = "30m"
+          + delete = "30m"
+          + read   = "5m"
+          + update = "30m"
+        }
+    }
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "canadacentral"
+      + name     = "app-test-resource-group"
+      + tags     = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Managedby"     = "hello@clouddrove.com"
+          + "Name"          = "app-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+  # module.subnet.azurerm_route_table.rt[0] will be created
+  + resource "azurerm_route_table" "rt" {
+      + bgp_route_propagation_enabled = true
+      + id                            = (known after apply)
+      + location                      = "canadacentral"
+      + name                          = "app-test-default-subnet-route-table"
+      + resource_group_name           = "app-test-resource-group"
+      + route                         = [
+          + {
+              + address_prefix         = "0.0.0.0/0"
+              + name                   = "rt-test"
+              + next_hop_type          = "Internet"
+                # (1 unchanged attribute hidden)
+            },
+        ]
+      + subnets                       = (known after apply)
+      + tags                          = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Managedby"     = "hello@clouddrove.com"
+          + "Name"          = "app-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-subnet.git"
+        }
+    }
+
+  # module.subnet.azurerm_subnet.subnet[0] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.30.0.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "app-subnet"
+      + private_endpoint_network_policies             = "Disabled"
+      + private_link_service_network_policies_enabled = true
+      + resource_group_name                           = "app-test-resource-group"
+      + virtual_network_name                          = "app-test-vnet"
+    }
+
+  # module.subnet.azurerm_subnet_route_table_association.main[0] will be created
+  + resource "azurerm_subnet_route_table_association" "main" {
+      + id             = (known after apply)
+      + route_table_id = (known after apply)
+      + subnet_id      = (known after apply)
+    }
+
+  # module.vnet.azurerm_virtual_network.vnet[0] will be created
+  + resource "azurerm_virtual_network" "vnet" {
+      + address_space                  = [
+          + "10.30.0.0/22",
+        ]
+      + dns_servers                    = []
+      + flow_timeout_in_minutes        = 10
+      + guid                           = (known after apply)
+      + id                             = (known after apply)
+      + location                       = "canadacentral"
+      + name                           = "app-test-vnet"
+      + private_endpoint_vnet_policies = "Disabled"
+      + resource_group_name            = "app-test-resource-group"
+      + subnet                         = (known after apply)
+      + tags                           = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Managedby"     = "hello@clouddrove.com"
+          + "Name"          = "app-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-vnet"
+        }
+    }
+
+Plan: 10 to add, 0 to change, 0 to destroy.
+
+Changes to Outputs:
+  + address_prefixes               = [
+      + [
+          + "10.30.0.0/24",
+        ],
+    ]
+  + resource_group_location        = "canadacentral"
+  + resource_group_name            = "app-test-resource-group"
+  + route_table_associated_subnets = [
+      + [
+          + (known after apply),
+        ],
+    ]
+  + route_table_id                 = (known after apply)
+  + security_group_id              = (known after apply)
+  + security_group_name            = "nsg-app-test-cace"
+  + subnet_ids                     = [
+      + (known after apply),
+    ]
+  + subnet_name                    = [
+      + "app-subnet",
+    ]
+  + virtual_n
```
See the full diff from https://github.com/terraform-az-modules/terraform-azure-nsg/actions/runs/15423973281

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-nsg/actions/runs/15423973281)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->